<a href="https://colab.research.google.com/github/Neel12-coder/Python-Datascience/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**Pandas**

In [ ]:
import numpy as np

In [ ]:
import pandas as pd

In [ ]:
label=['a','b','c','d']

In [ ]:
data = [1,2,3,4]

In [ ]:
dic = {'a':1,'b':2,'c':3,'d':4}

In [ ]:
a= np.array(data)

In [ ]:
pd.Series(data,label)

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
pd.Series(data)

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
pd.Series(label)

0    a
1    b
2    c
3    d
dtype: object

In [ ]:
pd.Series(dic)

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
series1 = pd.Series(data=[1,2,3,4,5],index=["marry","john","david","jerry","nick"])

In [ ]:
series1

marry    1
john     2
david    3
jerry    4
nick     5
dtype: int64

In [ ]:
series2 = pd.Series(data=[1,4,2,3,1],index=["marry","marry","danial","nick","perak"])

In [ ]:
series2

marry     1
marry     4
danial    2
nick      3
perak     1
dtype: int64

In [ ]:
series1 + series2

danial    NaN
david     NaN
jerry     NaN
john      NaN
marry     2.0
marry     5.0
nick      8.0
perak     NaN
dtype: float64

#**Pandas Dataframes**

In [ ]:
import pandas as pd

In [ ]:
import numpy as np
from numpy.random import randn

In [ ]:
np.random.seed(10)

In [ ]:
df = pd.DataFrame(data=randn(3,3),index=['A','B','C'],columns=['X','Y','Z'])

In [ ]:
df

          X         Y         Z
A  1.331587  0.715279 -1.545400
B -0.008384  0.621336 -0.720086
C  0.265512  0.108549  0.004291

In [ ]:
df['X']

A    1.331587
B   -0.008384
C    0.265512
Name: X, dtype: float64

In [ ]:
type(df['X'])

pandas.core.series.Series

In [ ]:
df[['X','Y']]

          X         Y
A  1.331587  0.715279
B -0.008384  0.621336
C  0.265512  0.108549

In [ ]:
type(df[['X','Y']])

pandas.core.frame.DataFrame

In [ ]:
df['W']= df['X'] + df['Y']

In [ ]:
df

          X         Y         Z         W
A  1.331587  0.715279 -1.545400  2.046865
B -0.008384  0.621336 -0.720086  0.612952
C  0.265512  0.108549  0.004291  0.374060

In [ ]:
df.drop("W",axis=1) #axis=1 is for column..drop is not permanent

          X         Y         Z
A  1.331587  0.715279 -1.545400
B -0.008384  0.621336 -0.720086
C  0.265512  0.108549  0.004291

In [ ]:
df.drop("A")

          X         Y         Z         W
B -0.008384  0.621336 -0.720086  0.612952
C  0.265512  0.108549  0.004291  0.374060

In [ ]:
df

          X         Y         Z         W
A  1.331587  0.715279 -1.545400  2.046865
B -0.008384  0.621336 -0.720086  0.612952
C  0.265512  0.108549  0.004291  0.374060

In [ ]:
# to delete a row or col permanently
df.drop("W",axis=1,inplace=True)

In [ ]:
df

          X         Y         Z
A  1.331587  0.715279 -1.545400
B -0.008384  0.621336 -0.720086
C  0.265512  0.108549  0.004291

In [ ]:
# to extract rows in dataframe

df.loc["A"]

X    1.331587
Y    0.715279
Z   -1.545400
Name: A, dtype: float64

In [ ]:
df.iloc[0]

X    1.331587
Y    0.715279
Z   -1.545400
Name: A, dtype: float64

In [ ]:
df.loc["A","X"] #to extract one ele

1.331586504129518

In [ ]:
df.loc[["A","B"],["X","Y"]]

          X         Y
A  1.331587  0.715279
B -0.008384  0.621336

In [ ]:
df

          X         Y         Z
A  1.331587  0.715279 -1.545400
B -0.008384  0.621336 -0.720086
C  0.265512  0.108549  0.004291

#**Conditional Selection**

In [ ]:
df > 0

       X     Y      Z
A   True  True  False
B  False  True  False
C   True  True   True

In [ ]:
dfnew = df>0

In [ ]:
dfnew

       X     Y      Z
A   True  True  False
B  False  True  False
C   True  True   True

In [ ]:
df[dfnew]

          X         Y         Z
A  1.331587  0.715279       NaN
B       NaN  0.621336       NaN
C  0.265512  0.108549  0.004291

In [ ]:
df[df > 0] # one line syntax

          X         Y         Z
A  1.331587  0.715279       NaN
B       NaN  0.621336       NaN
C  0.265512  0.108549  0.004291

In [ ]:
#we usually dont need NaN so,...
df[df["X"] > 0]

          X         Y         Z
A  1.331587  0.715279 -1.545400
C  0.265512  0.108549  0.004291

In [ ]:
df

          X         Y         Z
A  1.331587  0.715279 -1.545400
B -0.008384  0.621336 -0.720086
C  0.265512  0.108549  0.004291

In [ ]:
df[df["X"] > 0]["X"]

A    1.331587
C    0.265512
Name: X, dtype: float64

In [ ]:
# executing multiple statements
df[ (df["X"]>0) & (df["Y"]>0)]

          X         Y         Z
A  1.331587  0.715279 -1.545400
C  0.265512  0.108549  0.004291

In [ ]:
df.reset_index() #not permanent, to make permanent inplace=True

  index         X         Y         Z
0     A  1.331587  0.715279 -1.545400
1     B -0.008384  0.621336 -0.720086
2     C  0.265512  0.108549  0.004291

In [ ]:
import pandas as pd

In [ ]:
import numpy as np
from numpy.random import randn

In [ ]:
np.random.seed(10)

In [ ]:
df = pd.DataFrame(data= randn(3,3),index=['A','B','C'],columns=['X','Y','Z'])

In [ ]:
df

          X         Y         Z
A  1.331587  0.715279 -1.545400
B -0.008384  0.621336 -0.720086
C  0.265512  0.108549  0.004291

In [ ]:
df.reset_index()

  index         X         Y         Z
0     A  1.331587  0.715279 -1.545400
1     B -0.008384  0.621336 -0.720086
2     C  0.265512  0.108549  0.004291

In [ ]:
df["states"] = "NY IN CH".split()

In [ ]:
df

          X         Y         Z states
A  1.331587  0.715279 -1.545400     NY
B -0.008384  0.621336 -0.720086     IN
C  0.265512  0.108549  0.004291     CH

In [ ]:
df.set_index("states") #to make it permanent ... inplace=True

               X         Y         Z
states
NY      1.331587  0.715279 -1.545400
IN     -0.008384  0.621336 -0.720086
CH      0.265512  0.108549  0.004291

In [ ]:
df

          X         Y         Z states
A  1.331587  0.715279 -1.545400     NY
B -0.008384  0.621336 -0.720086     IN
C  0.265512  0.108549  0.004291     CH

# Missing Values

In [3]:
import pandas as pd
import numpy as np

In [4]:
dic = {'A':[1,2,np.nan],'B':[4,np.nan,np.nan],'C':[5,6,7]}

In [5]:
df1 = pd.DataFrame(dic)

In [6]:
df1

     A    B  C
0  1.0  4.0  5
1  2.0  NaN  6
2  NaN  NaN  7

In [7]:
df1.dropna()# axis = 1 for colms , to make per inplace = True

     A    B  C
0  1.0  4.0  5

In [8]:
df1.fillna(value=-1)

     A    B  C
0  1.0  4.0  5
1  2.0 -1.0  6
2 -1.0 -1.0  7

In [11]:
df1.dropna(axis=1,thresh=2) #thresh means (require that many non-nan values)

     A  C
0  1.0  5
1  2.0  6
2  NaN  7

In [12]:
df1["A"].fillna(value=df1['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# GROUP BY

In [13]:
import numpy as np

In [14]:
import pandas as pd

In [15]:
a = {"Company":["Microsoft","Google","Facebook","Google","Microsoft","Facebook"],
     "Person":["Sam","John","Harry","Jerry","Tom","Jack"],
     "Sales":[120,240,134,145,453,500]}

In [16]:
df = pd.DataFrame(a)

In [17]:
df

     Company Person  Sales
0  Microsoft    Sam    120
1     Google   John    240
2   Facebook  Harry    134
3     Google  Jerry    145
4  Microsoft    Tom    453
5   Facebook   Jack    500

In [18]:
g= df.groupby("Company")
g

In [19]:
g.mean()

           Sales
Company
Facebook   317.0
Google     192.5
Microsoft  286.5

In [20]:
g.sum()

           Sales
Company
Facebook     634
Google       385
Microsoft    573

In [21]:
g.std().loc["Facebook"]

Sales    258.801082
Name: Facebook, dtype: float64

In [22]:
g.count()

           Person  Sales
Company
Facebook        2      2
Google          2      2
Microsoft       2      2

In [23]:
g.max()

          Person  Sales
Company
Facebook    Jack    500
Google      John    240
Microsoft    Tom    453

In [24]:
df.groupby("Company").describe()

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
Facebook    2.0  317.0  258.801082  134.0  225.50  317.0  408.50  500.0
Google      2.0  192.5   67.175144  145.0  168.75  192.5  216.25  240.0
Microsoft   2.0  286.5  235.466558  120.0  203.25  286.5  369.75  453.0

In [25]:
df.groupby("Company").describe().transpose()

Company        Facebook      Google   Microsoft
Sales count    2.000000    2.000000    2.000000
      mean   317.000000  192.500000  286.500000
      std    258.801082   67.175144  235.466558
      min    134.000000  145.000000  120.000000
      25%    225.500000  168.750000  203.250000
      50%    317.000000  192.500000  286.500000
      75%    408.500000  216.250000  369.750000
      max    500.000000  240.000000  453.000000

In [26]:
df

     Company Person  Sales
0  Microsoft    Sam    120
1     Google   John    240
2   Facebook  Harry    134
3     Google  Jerry    145
4  Microsoft    Tom    453
5   Facebook   Jack    500

#Merging Joining And Concatenating

In [27]:
import pandas as pd

In [28]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [29]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                        index=[4, 5, 6, 7])

In [30]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [31]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [32]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [33]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [34]:
#concatination glues together dataframes .. make sure the col names are same
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [35]:
pd.concat([df1,df2,df3],axis =1) #axis=1 is for col

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [36]:
# For Merging you should have a common column

left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [37]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [38]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [39]:
#merge (similar to join in sql)
pd.merge(left,right,how="inner",on="key") # based on 'key' col inner join/merge

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [44]:
# For Merging you should have a common column

left = pd.DataFrame({'key': ['K0', 'K1', 'K4', 'K3'],
                     'key1': ['K0', 'K0', 'K1', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'key1': ['K0', 'K1', 'K1', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [45]:
pd.merge(left,right,how="inner",on=['key','key1']) #merging on multiple common keys

  key key1   A   B   C   D
0  K0   K0  A0  B0  C0  D0
1  K3   K3  A3  B3  C3  D3

In [46]:
#join on potentially two different dataframes

left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [52]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [50]:
right.join(left,how="inner")

     C   D   A   B
K0  C0  D0  A0  B0
K2  C2  D2  A2  B2

In [51]:
left.join(right,how="outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

#Pandas Operations

In [53]:
import pandas as pd
import numpy as np

In [59]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','jkl']
                   })

In [60]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  jkl

In [61]:
#to find unique values
df['col2'].unique()

array([444, 555, 666])

In [62]:
len(df['col2'].unique()) #count or no. of unique val

3

In [63]:
df['col2'].nunique() #nunique is no of unique values

3

In [65]:
df['col2'].value_counts() #count of each val in dataframe

444    2
555    1
666    1
Name: col2, dtype: int64

In [66]:
df.value_counts()

col1  col2  col3
4     444   jkl     1
3     666   ghi     1
2     555   def     1
1     444   abc     1
dtype: int64

In [67]:
df.iloc[0].value_counts()

abc    1
1      1
444    1
Name: 0, dtype: int64

In [68]:
#to execute our custom functions in 

def powf(inp):
  return inp**2

In [69]:
df['col1'].apply(powf) #inside apply we provide our custom made functions

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [72]:
# if we r going to use func only once in our entire thing use lambda

df['col1'].apply(lambda x:x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [73]:
df.drop("col1",axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  jkl

In [74]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  jkl

In [77]:
#to extract all column names from your dataframe

df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [78]:
df.index #for rows

RangeIndex(start=0, stop=4, step=1)

In [79]:
#for sorting of data inside dataframe
df.sort_values("col2")

   col1  col2 col3
0     1   444  abc
3     4   444  jkl
1     2   555  def
2     3   666  ghi

In [80]:
#to find null val in df

df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False